music_app/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "edison_8@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        @user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2024-04-16 21:26:03.947374"], ["id", 5]]
---
    def reset_session_token!
        self.session_token = self.generate_unique_session_token
        self.save!